Integration Service/controlm25/xmldata/EMAPI_act_retrieve_jobs.xml

<?xml version="1.0" encoding="ISO-8859-1" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Body>
	<ctmem:request_act_retrieve_jobs xmlns:ctmem="http://www.bmc.com/ctmem/schema800">
		<ctmem:user_token>$USER_TOKEN$</ctmem:user_token>
		<ctmem:max_returned_nodes>1000</ctmem:max_returned_nodes>
		<ctmem:retrieve_jobs_criterion>
			<ctmem:include>
				<ctmem:search_criterion>
					<ctmem:param>
						<ctmem:name>ORDER_ID</ctmem:name>
						<ctmem:operator>LIKE</ctmem:operator>
						<ctmem:value>$ORDER_ID$</ctmem:value>
					</ctmem:param>
				</ctmem:search_criterion>
			</ctmem:include>
			<!--ctmem:exclude>
				<ctmem:search_criterion>
					<ctmem:param>
						<ctmem:name>DATA_CENTER</ctmem:name>
						<ctmem:operator>EQ</ctmem:operator>
						<ctmem:value>vic-vw-ctrl-m</ctmem:value>
					</ctmem:param>
				</ctmem:search_criterion>
			</ctmem:exclude-->
		</ctmem:retrieve_jobs_criterion>
	</ctmem:request_act_retrieve_jobs>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
